tiborsimon/embedded-tdd-headers/pic/pic16/pic16f886_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F886_H_
#define _PIC16F886_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define RA5                           18
#define RA6                           19
#define RA7                           20
#define PORTB                         21
#define RB0                           22
#define RB1                           23
#define RB2                           24
#define RB3                           25
#define RB4                           26
#define RB5                           27
#define RB6                           28
#define RB7                           29
#define PORTC                         30
#define RC0                           31
#define RC1                           32
#define RC2                           33
#define RC3                           34
#define RC4                           35
#define RC5                           36
#define RC6                           37
#define RC7                           38
#define PORTE                         39
#define RE3                           40
#define INTCON                        41
#define RBIF                          42
#define INTF                          43
#define T0IF                          44
#define TMR0IF                        45
#define RBIE                          46
#define INTE                          47
#define T0IE                          48
#define TMR0IE                        49
#define PEIE                          50
#define GIE                           51
#define PIR1                          52
#define TMR1IF                        53
#define TMR2IF                        54
#define CCP1IF                        55
#define SSPIF                         56
#define TXIF                          57
#define RCIF                          58
#define ADIF                          59
#define PIR2                          60
#define CCP2IF                        61
#define ULPWUIF                       62
#define BCLIF                         63
#define EEIF                          64
#define C1IF                          65
#define C2IF                          66
#define OSFIF                         67
#define T1CON                         68
#define TMR1ON                        69
#define TMR1CS                        70
#define T1SYNC                        71
#define T1INSYNC                      72
#define nT1SYNC                       73
#define T1OSCEN                       74
#define T1CKPS0                       75
#define T1CKPS                        76
#define T1CKPS1                       77
#define TMR1GE                        78
#define T1GINV                        79
#define T1GIV                         80
#define T2CON                         81
#define T2CKPS0                       82
#define T2CKPS                        83
#define T2CKPS1                       84
#define TMR2ON                        85
#define TOUTPS0                       86
#define TOUTPS                        87
#define TOUTPS1                       88
#define TOUTPS2                       89
#define TOUTPS3                       90
#define SSPCON                        91
#define SSPM0                         92
#define SSPM                          93
#define SSPM1                         94
#define SSPM2                         95
#define SSPM3                         96
#define CKP                           97
#define SSPEN                         98
#define SSPOV                         99
#define WCOL                          100
#define CCP1CON                       101
#define CCP1M0                        102
#define CCP1M                         103
#define CCP1M1                        104
#define CCP1M2                        105
#define CCP1M3                        106
#define CCP1Y                         107
#define DC1B                          108
#define DC1B0                         109
#define CCP1X                         110
#define DC1B1                         111
#define P1M                           112
#define P1M0                          113
#define P1M1                          114
#define RCSTA                         115
#define RCD8                          116
#define RX9D                          117
#define OERR                          118
#define FERR                          119
#define ADDEN                         120
#define CREN                          121
#define SREN                          122
#define RC8_9                         123
#define RC9                           124
#define RX9                           125
#define nRC8                          126
#define SPEN                          127
#define CCP2CON                       128
#define CCP2M                         129
#define CCP2M0                        130
#define CCP2M1                        131
#define CCP2M2                        132
#define CCP2M3                        133
#define DC2B0                         134
#define CCP2Y                         135
#define DC2B1                         136
#define CCP2X                         137
#define ADCON0                        138
#define ADON                          139
#define nDONE                         140
#define GO_nDONE                      141
#define GO_DONE                       142
#define GO                            143
#define CHS                           144
#define CHS0                          145
#define CHS1                          146
#define CHS2                          147
#define CHS3                          148
#define ADCS                          149
#define ADCS0                         150
#define ADCS1                         151
#define OPTION_REG                    152
#define PS                            153
#define PS0                           154
#define PS1                           155
#define PS2                           156
#define PSA                           157
#define T0SE                          158
#define T0CS                          159
#define INTEDG                        160
#define nRBPU                         161
#define TRISA                         162
#define TRISA0                        163
#define TRISA1                        164
#define TRISA2                        165
#define TRISA3                        166
#define TRISA4                        167
#define TRISA5                        168
#define TRISA6                        169
#define TRISA7                        170
#define TRISB                         171
#define TRISB0                        172
#define TRISB1                        173
#define TRISB2                        174
#define TRISB3                        175
#define TRISB4                        176
#define TRISB5                        177
#define TRISB6                        178
#define TRISB7                        179
#define TRISC                         180
#define TRISC0                        181
#define TRISC1                        182
#define TRISC2                        183
#define TRISC3                        184
#define TRISC4                        185
#define TRISC5                        186
#define TRISC6                        187
#define TRISC7                        188
#define TRISE                         189
#define TRISE3                        190
#define PIE1                          191
#define TMR1IE                        192
#define TMR2IE                        193
#define CCP1IE                        194
#define SSPIE                         195
#define TXIE                          196
#define RCIE                          197
#define ADIE                          198
#define PIE2                          199
#define CCP2IE                        200
#define ULPWUIE                       201
#define BCLIE                         202
#define EEIE                          203
#define C1IE                          204
#define C2IE                          205
#define OSFIE                         206
#define PCON                          207
#define nBOR                          208
#define nBO                           209
#define nPOR                          210
#define SBOREN                        211
#define ULPWUE                        212
#define OSCCON                        213
#define SCS                           214
#define LTS                           215
#define HTS                           216
#define OSTS                          217
#define IRCF                          218
#define IRCF0                         219
#define IRCF1                         220
#define IRCF2                         221
#define OSCTUNE                       222
#define TUN0                          223
#define TUN                           224
#define TUN1                          225
#define TUN2                          226
#define TUN3                          227
#define TUN4                          228
#define SSPCON2                       229
#define SEN                           230
#define RSEN                          231
#define PEN                           232
#define RCEN                          233
#define ACKEN                         234
#define ACKDT                         235
#define ACKSTAT                       236
#define GCEN                          237
#define SSPMSK                        238
#define MSK0                          239
#define MSK1                          240
#define MSK2                          241
#define MSK3                          242
#define MSK4                          243
#define MSK5                          244
#define MSK6                          245
#define MSK7                          246
#define SSPSTAT                       247
#define BF                            248
#define UA                            249
#define R_nW                          250
#define READ_WRITE                    251
#define I2C_READ                      252
#define nW                            253
#define R                             254
#define nWRITE                        255
#define R_W                           256
#define S                             257
#define I2C_START                     258
#define I2C_STOP                      259
#define P                             260
#define nA                            261
#define D_A                           262
#define D_nA                          263
#define D                             264
#define DATA_ADDRESS                  265
#define nADDRESS                      266
#define I2C_DATA                      267
#define CKE                           268
#define SMP                           269
#define WPUB0                         270
#define WPUB                          271
#define WPUB1                         272
#define WPUB2                         273
#define WPUB3                         274
#define WPUB4                         275
#define WPUB5                         276
#define WPUB6                         277
#define WPUB7                         278
#define IOCB0                         279
#define IOCB                          280
#define IOCB1                         281
#define IOCB2                         282
#define IOCB3                         283
#define IOCB4                         284
#define IOCB5                         285
#define IOCB6                         286
#define IOCB7                         287
#define VRCON                         288
#define VR0                           289
#define VR                            290
#define VR1                           291
#define VR2                           292
#define VR3                           293
#define VRSS                          294
#define VRR                           295
#define VROE                          296
#define VREN                          297
#define TXSTA                         298
#define TXD8                          299
#define TX9D                          300
#define TRMT                          301
#define BRGH                          302
#define SENDB                         303
#define SYNC                          304
#define TXEN                          305
#define TX8_9                         306
#define TX9                           307
#define nTX8                          308
#define CSRC                          309
#define SPBRG                         310
#define BRG0                          311
#define BRG1                          312
#define BRG2                          313
#define BRG3                          314
#define BRG4                          315
#define BRG5                          316
#define BRG6                          317
#define BRG7                          318
#define SPBRGH                        319
#define BRG8                          320
#define BRG9                          321
#define BRG10                         322
#define BRG11                         323
#define BRG12                         324
#define BRG13                         325
#define BRG14                         326
#define BRG15                         327
#define PWM1CON                       328
#define PDC0                          329
#define PDC                           330
#define PDC1                          331
#define PDC2                          332
#define PDC3                          333
#define PDC4                          334
#define PDC5                          335
#define PDC6                          336
#define PRSEN                         337
#define PSSBD                         338
#define PSSBD0                        339
#define PSSBD1                        340
#define PSSAC                         341
#define PSSAC0                        342
#define PSSAC1                        343
#define ECCPAS0                       344
#define ECCPAS                        345
#define ECCPAS1                       346
#define ECCPAS2                       347
#define ECCPASE                       348
#define PSTRCON                       349
#define STRA                          350
#define STRB                          351
#define STRC                          352
#define STRD                          353
#define STRSYNC                       354
#define ADCON1                        355
#define VCFG0                         356
#define VCFG1                         357
#define ADFM                          358
#define WDTCON                        359
#define SWDTEN                        360
#define WDTPS                         361
#define WDTPS0                        362
#define WDTPS1                        363
#define WDTPS2                        364
#define WDTPS3                        365
#define CM1CON0                       366
#define C1CH                          367
#define C1CH0                         368
#define C1CH1                         369
#define C1R                           370
#define C1POL                         371
#define C1OE                          372
#define C1OUT                         373
#define C1ON                          374
#define CM2CON0                       375
#define C2CH0                         376
#define C2CH                          377
#define C2CH1                         378
#define C2R                           379
#define C2POL                         380
#define C2OE                          381
#define C2OUT                         382
#define C2ON                          383
#define CM2CON1                       384
#define C2SYNC                        385
#define T1GSS                         386
#define C2RSEL                        387
#define C1RSEL                        388
#define MC2OUT                        389
#define MC1OUT                        390
#define SRCON                         391
#define FVREN                         392
#define PULSR                         393
#define PULSS                         394
#define C2REN                         395
#define C1SEN                         396
#define SR0                           397
#define SR1                           398
#define BAUDCTL                       399
#define ABDEN                         400
#define WUE                           401
#define BRG16                         402
#define SCKP                          403
#define RCIDL                         404
#define ABDOVF                        405
#define ANSEL                         406
#define ANS0                          407
#define ANS1                          408
#define ANS2                          409
#define ANS3                          410
#define ANS4                          411
#define ANSELH                        412
#define ANS8                          413
#define ANS9                          414
#define ANS10                         415
#define ANS11                         416
#define ANS12                         417
#define ANS13                         418
#define EECON1                        419
#define RD                            420
#define WR                            421
#define WREN                          422
#define WRERR                         423
#define EEPGD                         424

#endif // _PIC16F886_H_
